[
  {
    "id": "StartMsg",
    "translation": "Привет! 👋 Это телеграм-бот *FrescoAiBot*. Я взаимодействую с _ChatGPT_, а также с нейросетью для генерации изображений _Dall-E_ 🤖\n\nЧто это значит?\n\n📲 *Режим ChatGPT* работает с текстовой информацией. Вы можете задать мне любой вопрос, попросить написать поздравление или текст для публикации, составить план для любого действия (контент, питание, тренировки и т.п.). У меня есть 2 версии:\n\n▪️ _GPT-3.5_ — это усовершенствованная модель после GPT-3, которая является одной из самых мощных для генерации текста.\n\n▪️ _GPT-4_ обладает ещё большим числом параметров, чем предыдущие модели. У неё улучшена способность понимать и генерировать тексты, а также усовершенствована работа с задачами, требующими логического мышления и распознания контекста. \n\n🎨 *Режим Dall-E 3* генерирует изображения по запросу. Например, вы можете попросить меня нарисовать кота, который играет с мячом, и я направлю Вам картинку в ответ.\n\n💬 *Режим диалога (контекста)* поможет дополнить запрос. Когда контекст активирован, я учитываю свой предыдущий ответ и дополняю его новой командой. Например, Вы попросили меня написать поздравление с Днём рождения. В следующем сообщении, Вы можете уточнить, что это поздравление для лучшего друга, и я пришлю обновлённую версию.\n\n💬 🚫 Если вы хотите начать диалог на новую тему, чтобы бот забыл контекст предыдущего разговора, используйте команду: /forget\n\n👉 *Доступ к боту:*\n\nВ моей бесплатной версии у Вас есть доступ к 5️⃣ запросам в день (они обновляются каждые 24 часа). Увеличить число запросов, а также получить доступ к _GPT-4_ и _режиму «Диалог»_ можно с ежемесячной подпиской:\n\n✅ Start: 1️⃣0️⃣ запросов в день — 4,5$\n✅ Pro: 2️⃣0️⃣ запросов в день — 9,9$\n✅ Boss: 5️⃣0️⃣ запросов в день — 19,9$ \n\n*Способы оплаты:*\n\n💳 Карта\n💲Криптовалюта\n\n💸 Купить подписку /buy\n\n🎁 Также я люблю делать подарки! Вы можете пригласить друга и получить подписку «Start» на 7 дней бесплатно. Чтобы получить ссылку-приглашение, используйте команду /invite\n\nЧтобы выбрать режим, нажмите на кнопку с его названием ⬇️"
  },
  {
    "id": "BuyMsg",
    "translation": "🤩 *Больше запросов*. С подпиской Вы увеличите количество запросов для бота в день. Если в бесплатной версии Вы используете все 5 запросов за день, с подпиской Вам не придётся ждать 24 часа до обновления доступа, и Вы сможете продолжить взаимодействие с ботом.\n\n🎉 *Доступ к ChatGPT-4*. С подпиской у Вас откроется доступ к режиму ChatGPT-4. Это усовершенствованная модель, которая лучше понимает и генерирует тексты, а также работает с задачами, требующими логического мышления и распознания контекста.\n\n💸 *Выбрать ежемесячную подписку*:\n\n✅ Start: 1️⃣0️⃣ запросов в день — 4,5$\n✅ Pro: 2️⃣0️⃣ запросов в день — 9,9$\n✅ Boss: 5️⃣0️⃣ запросов в день — 19,9$\n\n*Способы оплаты*:\n\n💳 Карта\n💲Криптовалюта\n\n*Как оплатить?*\n\n1. Выберите тариф\n2. Нажмите на кнопку «Купить»\n3. Перейдите по ссылке на страницу нашего пертнёра и выберите удобный способ оплаты\n\nКупить подписку ⬇️"
  },
  {
    "id": "ErrorMsg",
    "translation": "❌ Что-то пошло не так. 🤕 Попробуйте позже"
  },
  {
    "id": "StatusMsg",
    "translation": "📊*Информация о подписке*\n\nВаша подписка: %s (%d запросов в день) \nДоступно: %d запросов\nДействительна до: %s\nТехническая поддержка: @dendefoe\n\n🎁 Пригласите друга и получите в подарок подписку «Start» на 7 дней бесплатно. Чтобы получить ссылку-приглашение, используйте команду /invite\n\n💸 Подключить улучшенный тариф: /buy"
  },
  {
    "id": "UnsupportedMessageType",
    "translation": "❌ Извините, отправленный вами тип сообщения на данный момент не поддерживается"
  },
  {
    "id": "MessageIsTooShort",
    "translation": "❌ Вы отправили слишком короткое сообщение. Минимальное количество символов — 4"
  },
  {
    "id": "SubscriptionPlanFree",
    "translation": "✅ «Free»"
  },
  {
    "id": "SubscriptionPlanStart",
    "translation": "✅ «Start»"
  },
  {
    "id": "SubscriptionPlanPro",
    "translation": "✅ «Pro»"
  },
  {
    "id": "SubscriptionPlanBoss",
    "translation": "✅ «Boss»"
  },
  {
    "id": "SubscriptionPlanHacker",
    "translation": "✅ «Hacker»"
  },
  {
    "id": "OptionsMessage",
    "translation": "⚙️ *Настройки бота*\n\nВ этом разделе Вы можете:\n\n✅ Выбрать язык интерфейса (английский/русский).\n\n✅ Выбрать режим ChatGPT для работы с текстовой информацией.\nFrescoAiBot прдлагает 2 версии:\n\n▪️ GPT-3.5 — это усовершенствованная модель следующего поколения после GPT-3 (Generative Pre-trained Transformer 3), которая является одной из самых мощных моделей для генерации текста.\n\n▪️ GPT-4 обладает ещё большим числом параметров, чем предыдущие модели. У неё улучшена способность понимать и генерировать тексты, а также усовершенствована работа с задачами, требующими логического мышления и распознания контекста. \n\n✅ Выбрать режим Dall-E 3 для генерации изображений.\n\n✅ Включить или выключить поддержку контекста (режим диалога). Когда контекст активирован, бот учитывает свой предыдущий ответ и дополняет его новой командой.\n\n📲Техническая поддержка: @dendefoe\n\nЧтобы выбрать режим, нажмите на кнопку с его названием ⬇️"
  },
  {
    "id": "RunOutOfMessages",
    "translation": "😥 Извините, у Вас закончились сообщения\n\nКонтакт: @dendefoe\n\n🎁 Пригласите друга и получите в подарок подписку «Start» на 7 дней бесплатно. Чтобы получить реферальную ссылку, используйте команду /invite\n💸 Купить подписку: /buy"
  },
  {
    "id": "InviteLink",
    "translation": "🎁 *Пригласить друга*\n\nПригласите друга и получите в подарок подписку «Start» на 7 дней 🎉\n\nДля этого скопируйте ссылку-приглашение и отправьте другу:\n\n➡️ `https://t.me/call_fresco_bot?start=ref%d`\n\nПосле того, как Ваш друг присоединится к боту, я активирую для Вас подписку и пришлю уведомление 📩\n\nКоличество приглашений не ограничено. Каждую неделю вы можете приглашать нового друга и получать бесплатную подписку 🤩 \n\n👋 Если остались вопросы, Вы можете связаться с технической поддержкой: @dendefoe"
  },
  {
    "id": "SuccessRef",
    "translation": "🎉 Поздравляю! \n\nВаше реферальное приглашение оказалось успешным, и новый пользователь зарегистрировался по Вашей ссылке! В знак благодарности я активировал для Вас бонусную подписку \"Start\" на 7 дней 🎁✅\n\nНаслаждайтесь расширенными функциями и спасибо, что рассказываете обо мне! \nЕсли у Вас есть вопросы, не стесняйтесь задавать их. Приятного общения! 🤖🩵"
  },
  {
    "id": "Forget",
    "translation": "Бот успешно забыл контекст диалога 🧹"
  },
  {
    "id": "ModeSuccess",
    "translation": "Бот включил режим %s"
  },
  {
    "id": "EnglishLanguage",
    "translation": "Английский"
  },
  {
    "id": "RussianLanguage",
    "translation": "Русский"
  },
  {
    "id": "BackButton",
    "translation": "Назад"
  },
  {
    "id": "ContextSupportButton",
    "translation": "Режим диалога"
  },
  {
    "id": "LanguageSelectButton",
    "translation": "Язык интерфейса"
  },
  {
    "id": "ModeGpt4",
    "translation": "GPT-4 🤖"
  },
  {
    "id": "ModeGpt35",
    "translation": "GPT-3.5 🤖"
  },
  {
    "id": "ModeDalle3",
    "translation": "Dall-E 3 🎨"
  },
  {
    "id": "OnlyForPremium",
    "translation": "🫰💵 Недоступно для пользователей без подписки"
  },
  {
    "id": "StartCommandDescription",
    "translation": "Возможности бота"
  },
  {
    "id": "ForgetCommandDescription",
    "translation": "Забыть контекст диалога"
  },
  {
    "id": "BuyCommandDescription",
    "translation": "Купить подписку"
  },
  {
    "id": "InviteCommandDescription",
    "translation": "Пригласить друга"
  },
  {
    "id": "OptionsCommandDescription",
    "translation": "Настройки бота"
  },
  {
    "id": "StatusCommandDescription",
    "translation": "Моя подписка"
  },
  {
    "id": "BuyPlan1",
    "translation": "Купить Start"
  },
  {
    "id": "BuyPlan2",
    "translation": "Купить Pro"
  },
  {
    "id": "BuyPlan3",
    "translation": "Купить Boss"
  },
  {
    "id": "SubscriptionSuccess",
    "translation": "🎉 Поздравляем! Ваш платёж прошёл успешно! 🥳\n\n💡 Теперь у вас есть доступ ко всем премиальным функциям нашего бота. Начните исследовать новые возможности прямо сейчас и получайте максимум от нашего сервиса!\n\n🔒 Спасибо за доверие к нашему боту. Мы обещаем постоянное улучшение и обновление наших услуг для вашего удобства.\n\n✅ Наслаждайтесь вашей подпиской и ожидайте массу полезного контента!\n\nЕсли у вас возникнут вопросы или вам понадобится поддержка, обращайтесь в любое время — мы всегда рады помочь!\n"
  },
  {
    "id": "GptLoading",
    "translation": "Бот думает, пожалуйста, подождите..."
  },
  {
    "id": "DalleLoading",
    "translation": "Бот рисует, подождите пожалуйтса..."
  }
]
